[
  {
    "id": "2005-bri",
    "date": "2005-01-01",
    "title": "China launches Belt and Road foothold in Latin America",
    "summary": "State-owned enterprises announce first wave of infrastructure loans in the region.",
    "impact": "Establishes long-term financing leverage across critical logistics nodes."
  },
  {
    "id": "2009-ecuador",
    "date": "2009-08-15",
    "title": "Ecuador's Coca Codo Sinclair Dam construction begins",
    "summary": "Chinese firm Sinohydro undertakes Ecuador's largest energy project for $2.25 billion, demonstrating China's infrastructure reach.",
    "impact": "Demonstrates how debt leverage drives policy concessions and deepens Chinese influence in critical infrastructure."
  },
  {
    "id": "2016-honduras",
    "date": "2020-06-01",
    "title": "Próspera launches on Roatán",
    "summary": "A public-private governance partnership establishes the first Strategic Economic Zone aligned with U.S. standards.",
    "impact": "Demonstrates alternative model for transparent, rules-based development that respects sovereignty."
  },
  {
    "id": "2018-dominican",
    "date": "2018-05-01",
    "title": "Dominican Republic switches recognition to Beijing",
    "summary": "After 77 years of diplomatic relations with Taiwan, Dominican Republic establishes ties with PRC.",
    "impact": "Part of broader pattern of Chinese diplomatic pressure in the Caribbean and Central America."
  },
  {
    "id": "2023-honduras-switch",
    "date": "2023-03-26",
    "title": "Honduras switches recognition to Beijing",
    "summary": "Honduras becomes the latest Western Hemisphere nation to sever ties with Taiwan in favor of China.",
    "impact": "Leaves Paraguay as the last South American country maintaining diplomatic relations with Taiwan."
  },
  {
    "id": "2024-chancay",
    "date": "2024-11-14",
    "title": "Peru's Chancay megaport inaugurated",
    "summary": "China's Cosco opens $3.6 billion strategic port with 60% ownership, transforming Pacific trade routes.",
    "impact": "Gives Beijing substantial control over South American maritime logistics and trade infrastructure."
  }
]
